#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Acquiring state lock. This may take a few moments...
[0m[1mazurerm_resource_group.rgfirst: Refreshing state... [id=/subscriptions/889f443c-f979-411a-94c6-5866f349065a/resourceGroups/rg-mric-dev-003][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # azurerm_storage_account.stfirst[0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_account" "stfirst" {
      [32m+[0m[0m access_tier                       = (known after apply)
      [32m+[0m[0m account_kind                      = "StorageV2"
      [32m+[0m[0m account_replication_type          = "GRS"
      [32m+[0m[0m account_tier                      = "Standard"
      [32m+[0m[0m allow_nested_items_to_be_public   = true
      [32m+[0m[0m enable_https_traffic_only         = true
      [32m+[0m[0m id                                = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled = false
      [32m+[0m[0m is_hns_enabled                    = false
      [32m+[0m[0m large_file_share_enabled          = (known after apply)
      [32m+[0m[0m location                          = "uksouth"
      [32m+[0m[0m min_tls_version                   = "TLS1_2"
      [32m+[0m[0m name                              = "stacdevsp001"
      [32m+[0m[0m nfsv3_enabled                     = false
      [32m+[0m[0m primary_access_key                = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string    = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint             = (known after apply)
      [32m+[0m[0m primary_blob_host                 = (known after apply)
      [32m+[0m[0m primary_connection_string         = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint              = (known after apply)
      [32m+[0m[0m primary_dfs_host                  = (known after apply)
      [32m+[0m[0m primary_file_endpoint             = (known after apply)
      [32m+[0m[0m primary_file_host                 = (known after apply)
      [32m+[0m[0m primary_location                  = (known after apply)
      [32m+[0m[0m primary_queue_endpoint            = (known after apply)
      [32m+[0m[0m primary_queue_host                = (known after apply)
      [32m+[0m[0m primary_table_endpoint            = (known after apply)
      [32m+[0m[0m primary_table_host                = (known after apply)
      [32m+[0m[0m primary_web_endpoint              = (known after apply)
      [32m+[0m[0m primary_web_host                  = (known after apply)
      [32m+[0m[0m queue_encryption_key_type         = "Service"
      [32m+[0m[0m resource_group_name               = "rg-mric-dev-003"
      [32m+[0m[0m secondary_access_key              = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string  = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint           = (known after apply)
      [32m+[0m[0m secondary_blob_host               = (known after apply)
      [32m+[0m[0m secondary_connection_string       = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint            = (known after apply)
      [32m+[0m[0m secondary_dfs_host                = (known after apply)
      [32m+[0m[0m secondary_file_endpoint           = (known after apply)
      [32m+[0m[0m secondary_file_host               = (known after apply)
      [32m+[0m[0m secondary_location                = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint          = (known after apply)
      [32m+[0m[0m secondary_queue_host              = (known after apply)
      [32m+[0m[0m secondary_table_endpoint          = (known after apply)
      [32m+[0m[0m secondary_table_host              = (known after apply)
      [32m+[0m[0m secondary_web_endpoint            = (known after apply)
      [32m+[0m[0m secondary_web_host                = (known after apply)
      [32m+[0m[0m shared_access_key_enabled         = true
      [32m+[0m[0m table_encryption_key_type         = "Service"
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @slawpast, Action: `pull_request`*